ednieuw/ESP32-2432S028R-display/ESP322432S028_WordClockV004/ESP322432S028_WordClockV004.ino
/* 

--------------------------------------  
 Author .    : Ed Nieuwenhuys
 Changes V001: Derived from PocuterWordClockV052
 Changes V002: Stable version without ILI 9341 display / SD card
 Changes V003: Added ILI9341
 Changes V004: Screen layout. Displayprintln()
 Changes V005: BT connection on led blue, repait digitalprint. Turn off LEDs after 1 minute 
 Changes V006: LDR and Backlight regulation
 Changes V007: Debugging
 Changes V008: Added Light intensity S Slope T Min U Max
 Changes V009: Clean up code. Can be used with the ILI9341 Display. 
 Changes V010: Added a SK6812 LED-strip for a 4-language word clock 
 Changes V011: Compiles also for ESP32-S3. Added menu option & for requery NTP 
 Changes V012: Using ledcSetup(ledChannel, freq, resolution); to remove display flickering
               timeinfo.tm_mon starts at januari = 0 
               Menu entry & forces NTP update
               Digital display on screen updated
 Changes V013: Analog clock added as option
 Changes V014: Redecorated the analog clock
 Changes V015: Built analogue clock
 Changes V016: Built analogue clock. Corrected month in NTP. month 0 is janyary
 Changes V017: Stable
 Changes V018: SetStatusLED ESP32-s3
 Changes V019: Added WiFi.onEvents for connection and error coes and proper connection handling.
               WIFI.Events worked fine but ....
               Discontinued with ILI9341. Using WiFi.onEvent interrupts and crashes screen display while writing the screen
 Changes V020: Added OTA. This version compiles and runs on ESP32-C3. 
 Changes V021: Develop/Testing. Mem menory expanded. restart ESP32 once after first boot when no IP-addreess cq connection. 
 Changes V022: Works with SP32-C3. OTA fails with 2MB esp32-C3. Too less memory
 Changes V023: Works with SP32-C3.
 Changes V024: Corrected some compiler warnings 
 Changes V025: Isolate display functions to make it easy to add another display. Optimized lockup during printing to ILI9341 display
 Changes V026: If WIFI connection is lost reconnect every hour. Turn off Red LED after startup if Display LEDs is off
 Changes V027: Solved analog clock outer ring not shown after display off -> Added void RestartDisplay(void)
 Changes V028: Hour hand nicer. 
 

 ToDo:
 Use WIFI events with faster displays
Help scherm uitprinten
Store serial-print per dag op SD per maand for debugging purposes

How to compile: Install ESP32 boards
Set to:
Board: ESP32-C3 DEV module or ESP32-S3 DEV module
Flash size 4MB ot 2MB if you have a cheaper 2MB board.
OTA will not wotk on 2MB boards
Patition Scheme: Default or change to Minimal SPIFFS (1.9Mb with OTA, 190kB SPIFFS) if there is a memoty shortage


// ESP32-C3-12F layout seen from top
// ADC   ----- I0 19
// IO 01 ----- I0 18
// NC    ----- I0 10
// IO 02 ----- I0 09
// IO 03 ----- I0 08
// IO 04 ----- 3V3  
// IO 05 ----- GND  
// NC    ----- NC   
// NC    ----- I0 06
// GND   ----- I0 07
// 3V3   ----- NC   
// EN    ----- RX   
// IO 00 ----- TX   
// GND   ----- GND  
// 5V    ----- 3V3  

ILI9341 connections
MISO  to GPIO 10
LED   to 3V3
SCK   to GPIO 09
MOSI  to GPIO 08  
DC/RS to GPIO 06
RESET to GPIO 07
CS    to GND
GND   to GND
3V3   to 3V3
 
Usage of:
1 Screen, colours and fonts
2 BLE nRF UART connection with phone
3 Buttons
4 RGB LED
5 RTC module for time
6 ??SD-card or SPIFFS storage of a struct with settings
7 Get timezone corrected time with daylight savings from a NTP server via WIFI
8 Menu driven with serial monitor, BLE and WIFI
9 Change connection settings of WIFI via BLE
10 Get time with NTP server via WIFI
11 OTA updates of the software by WIFI

Starting the monitor will result in the board to be unresponsive. This is due to the CTS and RTS levels of the serial interface. Disabling the control lines prevents the board to become unresponsive. Edit the file “boards.txt” from the definition of the board. The file is located in the following directory, where xxxxx is the user name: “C:\Users\xxxxx\AppData\Local\Arduino15\packages\esp32\hardware\esp32\2.0.2”
To get to this location, find c:\Users\ednie\AppData\Local\Arduino15\packages\esp32\hardware\esp32\(2.0.9 or higher version )\boards.txt

esp32c3.serial.disableDTR=false
esp32c3.serial.disableRTS=false
to
esp32c3.serial.disableDTR=true
esp32c3.serial.disableRTS=true    

or of you have an s3 board esp32s3.serial....
               
*/
// =============================================================================================================================

//#define ESP32C3_DEV
//#define ESP32S3_DEV
#define ESP2432S028

#define ILI9341


//--------------------------------------------
// ESP32-C3 Includes defines and initialisations
//--------------------------------------------

#include <NimBLEDevice.h>      // For BLE communication  https://github.com/h2zero/NimBLE-Arduino
#include <ESPNtpClient.h>      // https://github.com/gmag11/ESPNtpClient
#include <WiFi.h>              // Used for web page 
#include <AsyncTCP.h>          // Used for webpage   https://github.com/me-no-dev/ESPAsyncWebServer
#include <ESPAsyncWebServer.h> // Used for webpage   https://github.com/me-no-dev/ESPAsyncWebServer
#include <AsyncElegantOTA.h>   // Used for OTA
#include <Preferences.h>
#include "Colors.h"
#include <TFT_eSPI.h> // Graphics and font library for ILI9341 driver chip
#include <SPI.h>
                        #ifdef ILI9341
//#include <Adafruit_ILI9341.h>  // https://github.com/adafruit/Adafruit_ILI9341
//#include <Adafruit_GFX.h>      // Core graphics library, with extra fonts.
                        #endif // ILI9341
#define HET     ColorLeds("Het",     0,   2, MINColor);   
#define IS      ColorLeds("is",      4,   5, SECColor);    Is = true; 
#define WAS     ColorLeds("was",     7,   9, SECColor);    Is = false;
#define MVIJF   ColorLeds("vijf",    11, 14, LetterColor); 
#define PRECIES ColorLeds("precies", 16, 22, LetterColor);
#define MTIEN   ColorLeds("tien",    25, 28, LetterColor); 
#define KWART   ColorLeds("kwart",   32, 36, LetterColor);
#define VOOR    ColorLeds("voor",    38, 41, LetterColor);
#define OVER    ColorLeds("over",    43, 46, LetterColor);
#define HALF    ColorLeds("half",    48, 51, LetterColor);
#define MIDDER  ColorLeds("midder",  53, 58, LetterColor);
#define VIJF    ColorLeds("vijf",    60, 63, LetterColor);
#define TWEE    ColorLeds("twee",    65, 68, LetterColor);
#define EEN     ColorLeds("een",     71, 73, LetterColor);
#define VIER    ColorLeds("vier",    76, 79, LetterColor);
#define ELF     ColorLeds("elf",     80, 82, LetterColor);
#define TIEN    ColorLeds("tien",    84, 87, LetterColor);
#define TWAALF  ColorLeds("twaalf",  89, 94, LetterColor);
#define DRIE    ColorLeds("drie",    97,100, LetterColor);
#define NEGEN   ColorLeds("negen",  102,106, LetterColor);
#define ACHT    ColorLeds("acht",   107,110, LetterColor);
#define NACHT   ColorLeds("nacht",  114,118, LetterColor);
#define ZES     ColorLeds("zes",    112,114, LetterColor);
#define ZEVEN   ColorLeds("zeven",  116,120, LetterColor);
#define NOEN    ColorLeds("noen",   120,123, LetterColor);
#define UUR     ColorLeds("uur",    125,127, LetterColor);
//#define EDSOFT  ColorLeds("EdSoft", 132,132, LetterColor);
#define X_OFF   ColorLeds("",         0,  2, 0);
#define X_ON    ColorLeds("",         0,  2, LetterColor);

